# MAPPING
MAPPING = {

    'salary_type_mapping': { # 薪資類型
        '10': '面議',
        '20': '論件計酬',
        '30': '時薪',
        '40': '日薪',
        '50': '月薪',
    },

    'job_role_mapping': { # 工作類型

    },

    'addr_area_mapping': { # 工作地區
        '台北': '北區',
        '新北': '北區',
        '宜蘭': '北區',
        '基隆': '北區',
        '桃園': '北區',
        '新竹': '北區',
        '苗栗': '中區',
        '台中': '中區',
        '彰化': '中區',
        '雲林': '中區',
        '嘉義': '南區',
        '台南': '南區',
        '高雄': '南區',
        '屏東': '南區',
        '南投': '南區',
        '花蓮': '東區',
        '台東': '東區',
        '澎湖': '離島',
        '金門': '離島',
        '連江': '離島',
        '其他': '海外',
    },


    'company_group_mapping': { # 公司集團

        # 富邦
        '富邦金融控股股份有限公司': '富邦',
        '富邦人壽保險股份有限公司(總公司)': '富邦',
        '台北富邦商業銀行股份有限公司': '富邦',
        '富邦產物保險股份有限公司': '富邦',
        '富邦綜合證券股份有限公司': '富邦',

        # 國泰
        '國泰人壽保險股份有限公司_總公司_國泰金控': '國泰',
        '國泰世紀產物保險股份有限公司': '國泰',
        '國泰綜合證券股份有限公司': '國泰',
        '國泰金控_國泰金融控股股份有限公司': '國泰',
        '國泰世華商業銀行股份有限公司_人力資源部': '國泰',
    },

}